** practice-score 
#+BEGIN_SRC lisp

(setq practice-score '(
:r111
:r15555
:r1111
:r21
:r555555
:r1-1-6666
:r1111))


#+END_SRC

#+RESULTS:
| 111 | 15555 | 1111 | 21 | 111 | 111 | 555555 | 1-1-6666 | 111 | 15555 | 111 | 21 | 111 | 111 | 1111 |



#+RESULTS:
| :R111 | :R15555 | :R1111 | :R21 | :R111 | :R111 | :R555555 | :R1-1-6666 | :R111 | :R15555 | :R111 | :R21 | :R111 | :R111 | :R1111 |
** see *db* contents
#+BEGIN_SRC lisp
*db*
#+END_SRC

#+RESULTS:
| :R1-1-6666 | NIL | :R555555 | NIL | :R21 | ((2 (1)) (1 (1))) | :R1111 | ((1 (1)) (1 (1)) (1 (1)) (1 (1))) | :R15555 | NIL | :R111 | ((1 (1)) (1 (1)) (1 (1))) |

** setting up key-value pairs

#+BEGIN_SRC lisp
(setf (getf *db* :r21) '((2 (1)) (1 (1))))
#+END_SRC

#+RESULTS:
| 2 | (1) |
| 1 | (1) |

#+BEGIN_SRC lisp
(setf (getf *db* :r1111) '((1 (1)) (1 (1)) (1 (1)) (1 (1))))
#+END_SRC

#+RESULTS:
| 1 | (1) |
| 1 | (1) |
| 1 | (1) |
| 1 | (1) |

#+BEGIN_SRC lisp
(setf (getf *db* :r111) '((1 (1)) (1 (1)) (1 (1))))
#+END_SRC

#+RESULTS:
| 1 | (1) |
| 1 | (1) |
| 1 | (1) |

